artillery/api-main.yml
# artillery run a9_ErTVkSY_R4qa1c8MmR6ckjlSPB6ftwxg
config:
  # base url 정의 (우리는 domain을 작성)
  target: 'https://5zirap.shop'
  phases:
    # 부하테스트 시간 (초)
    - duration: 200
      # 부하테스트 동안의 사용자 수 (초당 요청 수)
      arrivalRate: 20
      # rampTo: 40
      name: api-request-test
  payload:
    path: 'categorys.csv'
    fields:
      - 'category'
    skipHeader: true # CSV 파일의 첫 줄이 헤더인 경우 true로 설정
    loadAll: true
    name: category
# 부하 테스트 시나리오
scenarios:
  # 시나리오 정의
  - name: 'GET-hot-liveChat'
    flow:
      # EADDRINUSE로 인해 loop-count 추가
      - loop:
          - get:
              url: '/api/chatrooms/hotlivechat'
        count: 30
  - name: 'GET-hot-posts'
    flow:
      - loop:
          - get:
              url: '/api/posts/hot?category={{ $loopElement }}'
          - log: '{{ $loopElement }}' # 전체 응답을 로그로 출력
        over: # 변수를 못가져와서 루프안에 사용될 $loopElement를 수동으로 기입
          - CHAT
          - FASHION
        count: 15
  - name: 'GET-weekly-rank'
    flow:
      - loop:
          - get:
              url: '/api/points/ranks-weekly?num=10'
        count: 30
  - name: 'GET-total-rank'
    flow:
      - loop:
          - get:
              url: '/api/points/ranks?num=10'
        count: 30
  - name: 'GET-hashtags-rank'
    flow:
      - loop:
          - get:
              url: '/api/hashtags/ranks-weekly?num=10'
        count: 30