artillery/api-post.yml
config:
  # base url 정의
  target: 'https://5zirap.shop'
  phases:
    # 부하테스트 시간 (초)
    - duration: 200
      # 부하테스트 동안의 사용자 수 (초당 요청 수)
      arrivalRate: 20
      # rampTo: 300
      name: api-request-test
  payload:
    path: 'categorys.csv'
    fields:
      - 'category'
    skipHeader: true # CSV 파일의 첫 줄이 헤더인 경우 true로 설정
    loadAll: true
    name: category
  variables:
    # accessToken
    bearerToken: '' # Bearer 토큰을 변수로 선언
# 부하 테스트 시나리오
scenarios:
  # 시나리오 정의
  - name: 'GET-posts'
    flow:
      - loop:
          - get:
              url: '/api/posts?page=1'
        count: 10
  - name: 'GET-post-detail'
    flow:
      - loop:
          - get:
              url: '/api/posts/38'
        count: 10
  - name: 'GET-post-likes'
    flow:
      - loop:
          - get:
              url: '/api/posts/38/likes'
        count: 10
  - name: 'GET-post-my-like'
    flow:
      - loop:
          - get:
              url: '/api/posts/38/likes/me'
              headers:
                Authorization: 'Bearer {{ bearerToken }}'
        count: 10
  - name: 'GET-post-dislikes'
    flow:
      - loop:
          - get:
              url: '/api/posts/38/dislikes'
        count: 10
  - name: 'GET-post-my-dislike'
    flow:
      - loop:
          - get:
              url: '/api/posts/38/dislikes/me'
              headers:
                Authorization: 'Bearer {{ bearerToken }}'
        count: 10
  - name: 'GET-comments'
    flow:
      - loop:
          - get:
              url: '/api/posts/38/comments'
        count: 10